# 操作系统
## 1 常用操作系统简介

#### 按照应用领域来区分：
* 桌面操作系统
* 服务器操作系统
* 嵌入式操作系统
* 移动设备操作系统

1>桌面操作系统

* windows系列
 *  用户群体大

* macOS
 * 适合开发人员

* Linux
 * 应用软件少

2>服务器操作系统

* Linux
 * 安全、稳定、免费
 * 占有率高

* Windows Server
 * 付费
 * 占有率低

3>嵌入式操作系统

* Linux

4>移动设备操作系统

* iOS
* Android(基于Linux)

## 2 虚拟机
虚拟机（Virtual Machine）指通过软件模拟的具有完整硬件系统功能的、运行在一个完全隔离环境中的完整计算机系统。

* 虚拟系统通过生成现有操作系统的全新虚拟镜像，具有真实操作系统完全一样的功能
* 进入虚拟系统后，所有操作都是在这个全新的独立的虚拟机系统进行，可以独立安装运行软件，保存数据，拥有自己的独立桌面，不会对真正的系统产生任何影响
* 能够在现有的系统与虚拟镜像之间灵活切换

## 3 Linux内核及发行版本
### 3.1 Linux内核版本

* 内核（kernel)是系统的心脏，是运行程序和管理像磁盘和打印机等硬件设备的核心程序，它提供了一个在裸设备与应用程序间的抽象层
* Linux内核版本又分为**稳定版**和**开发版**，两种版本是相互关联，相互循环
 * **稳定版：** 具有工业级强度，可以广泛地应用和部署。
 * **开发版：**变换快，用来实验各种解决方案

### 3.2 Linux发行版本

* **Linux发行版（也被叫做GNU/Linux发行版）：**通常包括桌面环境、办公套件、媒体播放器、数据库等应用软件
* 常见的发行版：
 * Ubuntu
 * Readhat
 * Fedora
 * openSUSE
 * Linux Mint
 * Debian
 * Manjaro
 * Mageia
 * CentOS
 * Arch

## 4 文件和目录
### 4.1 单用户操作系统和多用户操作系统
* **单用户操作系统：**一台计算机在同一时间只能由一个用户使用，一个用户独立享用系统的全部硬件和软件资源
 * Windows XP 之前的版本都是单用户操作系统

* **多用户操作系统：**一台计算机在同一时间可以由多个用户使用，多个用户共享系统的全部硬件和软件资源
 * **Unix**和**Linux**

### 4.2 Windows和Linux文件系统区别
#### 4.2.1 Windows下的文件系统
```
windows主要用fat系列和ntfs
1． FAT文件系统：
FAT文件系统或分区格式最早应用于MS-DOS 和Windows 3.X操作系统中
2．FAT32文件系统：
FAT32是从FAT文件系统演化而来的，它是Fat系列文件系统的最后一个产品。
3． NTFS文件系统：
NTFS是新技术文件系统的简称。它能提供性能、安全性、可靠性和 FAT 文件系统所没有的高级功能的高级文件系统。
```
#### 4.2.2 Linux下文件管理系统
```
linux主要是ext
对于linux中文件包括属性（文件拥有者等）和权限（读写执行等）还有数据。对于属性和权限都保存在inode块中，而文件真正的数据确保存在data block中操作系统，而超级块中就保存的是整个文件系统的中容量，以及inode和data block的使用情况等
```

